app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('test', '180226_chatspace_フロント画面.png', 1, 2, '2018-03-09 02:55:35', '2018-03-09 02:55:35')
---
json.user_name @message.user.name
json.date @message.created_at.to_s(:date)