app/controllers/groups_controller.rb

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('test1', '2018-03-12 23:13:56', '2018-03-12 23:13:56')
---
  def create
    @group = Group.new(group_params)
      if @group.save