app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1

  def create
    @message = @group.messages.new(message_params)
    respond_to do |format|
      format.html{
    if @message.save
      redirect_to group_messages_path(@group), notice: 'メッセージが送信されました'
    else
      @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaaa', 'ah_funny9.jpg', 3, 2, '2018-03-06 06:21:19', '2018-03-06 06:21:19')
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1