app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%a%'))
---
  def index
    @users = User.where('name LIKE(?)', "%#{params[:keyword]}%")

UPDATE `users` SET `name` = 'akiratakai', `updated_at` = '2018-02-28 02:41:37' WHERE `users`.`id` = 2
---
  def update
    if current_user.update(user_params)